src/java/Bpel/FpToAllCompositeApp/src/jbiasa/FpToAllCompositeApp.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="FpToAllCompositeApp"
             xmlns:tns="FpToAllCompositeApp" xmlns:ns="http://j2ee.netbeans.org/wsdl/FpToAllBpelModule/src/FPRequestorWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/FpToAllBpelModule/src/FPRequestorWSDL" location="../jbiServiceUnits/FpToAllBpelModule/FPRequestorWSDL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:FPRequestorWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="FPRequestorWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="FpToAllCompositeApp"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="FpToAllCompositeApp"/>
            </output>
        </operation>
    </binding>
    <service name="FpToAllCompositeAppService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/FpToAllCompositeAppService1/casaPort1"/>
        </port>
    </service>
</definitions>
